Terraform plan for __staging__
<details>
<summary>Plan: 8 to add, 1 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.inventory-mrp-create.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-staging" -> (known after apply)
      ~ number              = "770633633132" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.inventory-mrp-create.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZm3bchYQ=" -> (known after apply)
      ~ id      = "**************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.inventory-mrp-create.google_pubsub_subscription.push_subscriptions["inventory-mrp-push"] will be updated in-place
  ~ resource "google_pubsub_subscription" "push_subscriptions" {
        id                         = "projects/ebo-staging/subscriptions/inventory-mrp-push"
        name                       = "inventory-mrp-push"
        # (7 unchanged attributes hidden)

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/inventory-mrp-create-dl"
          + max_delivery_attempts = 7
        }



      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
        # (2 unchanged blocks hidden)
    }

  # module.inventory-mrp-create.google_pubsub_subscription_iam_member.push_subscription_binding["inventory-mrp-push"] must be replaced
-/+ resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      ~ etag         = "BwXV/PNRq0g=" -> (known after apply)
      ~ id           = "*******************************************************************************************************************************************************" -> (known after apply)
      ~ member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.inventory-mrp-create.google_pubsub_topic_iam_member.push_topic_binding["inventory-mrp-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXV/PMlaYo=" -> (known after apply)
      ~ id      = "*************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ topic   = "projects/ebo-staging/topics/inventory-mrp-create" -> "projects/ebo-staging/topics/inventory-mrp-create-dl" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.inventory-mrp-create-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.inventory-mrp-create-dl.google_pubsub_subscription.pull_subscriptions["inventory-mrp-create-dl-sub"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-mrp-create-dl-sub"
      + project                    = "ebo-staging"
      + topic                      = "inventory-mrp-create-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory-mrp-create-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["inventory-mrp-create-dl-sub"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-mrp-create-dl-sub"
    }

  # module.inventory-mrp-create-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "inventory-mrp-create-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.inventory-mrp-create-dl.google_pubsub_topic_iam_member.pull_topic_binding["inventory-mrp-create-dl-sub"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/inventory-mrp-create-dl"
    }

Plan: 8 to add, 1 to change, 3 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #485](https://github.com/ebomart/commerce-infrastructure/actions/runs/1962962098)